updated docs & template.yaml to match production
